Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/katafc/httpd/target_count_13/repeat_3/9.txt
2020/01/27 14:34:47 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8009/
2020/01/27 14:35:17 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 10297 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8009
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      10297
Failed requests:        0
Total transferred:      2976411 bytes
HTML transferred:       463455 bytes
Requests per second:    343.23 [#/sec] (mean)
Time per request:       291.348 [ms] (mean)
Time per request:       2.913 [ms] (mean, across all concurrent requests)
Transfer rate:          96.89 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.0      1      19
Processing:     4  289 151.6    283    1367
Waiting:        2  266 138.3    271    1206
Total:          5  290 151.2    283    1368
Percentage of the requests served within a certain time (ms)
  50%    283
  66%    365
  75%    395
  80%    407
  90%    435
  95%    523
  98%    656
  99%    748
 100%   1368 (longest request)
2020/01/27 14:35:17 Matched stat line [Connect:        0    1   2.0      1      19 Connect 0 1 2.0 1 19]
2020/01/27 14:35:17 Matched stat line [Processing:     4  289 151.6    283    1367 Processing 4 289 151.6 283 1367]
2020/01/27 14:35:17 Matched stat line [Waiting:        2  266 138.3    271    1206 Waiting 2 266 138.3 271 1206]
2020/01/27 14:35:17 Matched stat line [Total:          5  290 151.2    283    1368 Total 5 290 151.2 283 1368]
2020/01/27 14:35:17 Matched percentline [  50%    283 50 283]
2020/01/27 14:35:17 Matched percentline [  66%    365 66 365]
2020/01/27 14:35:17 Matched percentline [  75%    395 75 395]
2020/01/27 14:35:17 Matched percentline [  80%    407 80 407]
2020/01/27 14:35:17 Matched percentline [  90%    435 90 435]
2020/01/27 14:35:17 Matched percentline [  95%    523 95 523]
2020/01/27 14:35:17 Matched percentline [  98%    656 98 656]
2020/01/27 14:35:17 Matched percentline [  99%    748 99 748]
2020/01/27 14:35:17 Matched percentline [ 100%   1368 100 1368]
{"connect":{"max":19,"mean":1,"median":1,"min":0,"stdDev":2},"percentiles":{"100":1368,"50":283,"66":365,"75":395,"80":407,"90":435,"95":523,"98":656,"99":748},"processing":{"max":1367,"mean":289,"median":283,"min":4,"stdDev":151.60000610351562},"total":{"max":1368,"mean":290,"median":283,"min":5,"stdDev":151.1999969482422},"waiting":{"max":1206,"mean":266,"median":271,"min":2,"stdDev":138.3000030517578}}